Repository: i-maslennikov/nuclear-river-validation-rules
Catalog: ValidationRules.Querying.Host/Properties/Resources.*.resx
Languages: cs

# FirmPositionMustNotHaveDeniedPositions
source: {0} "{1}" is prohibited for: {2} "{3}"
cs: {0} "{1}" je zakázána pro: {2} "{3}"

# FirmPositionMustNotHaveDeniedPositions_Order
source: {0} "{1}" is prohibited for: {2} "{3}" in the order {4}
cs: {0} "{1}" je zakázána pro: {2} "{3}" v objednávce {4}

# FirmAssociatedPositionShouldNotStayAlone
source: {0} "{1}" of this Order is the main for the following items: {2} "{3}"
cs: {0} "{1}" této objednávky je hlavní pro následující položky: {2} "{3}"

# AdvertisementAmountShouldMeetMinimumRestrictions
source: Item {0} should be present in build in quantity from {1} up to {2}. A quantity of items that can be issued per month {3} – {4}
cs: Potřebný počet pozice {0} ve sborce je od {1} do {2}. Povolený počet pozic ve vydání za měsíc je {3:MMMM} - {4}

# FirmAddressMustBeLocatedOnTheMap
source: The item {0} is issued for an empty address {1}
cs: Položka {0} je vytvořena s prázdnou adresou {1}

# FirmAssociatedPositionMustHavePrincipal
source: {1} "{0}" is an accompanying item, the main item is not found.
cs: {1} "{0}" je průvodní položka, hlavní položka nebyla nalezena.

# OrderShouldNotBeSignedBeforeBargain
source: The contract date cannot be later than the date of signing the order
cs: Smlouva nesmí být podepsána později než objednávka

# BranchOffice
source: Legal entity of company
cs: Pr. osoba organizace

# BranchOfficeOrganizationUnit
source: Legal entity of the Contractor
cs: Pr. osoba zhotovitele

# OrderPositionSalesModelMustMatchCategorySalesModel
source: Item "{0}" cannot be sold into category "{1}" of project "{2}"
cs: Pozici "{0}" nelze prodat do rubriky "{1}" v projektu "{2}"

# FirmAssociatedPositionMustHavePrincipalWithDifferentBindingObject
source: {0} "{1}" contains reference objects in conflict with reference objects of the following main item: {2} "{3}"
cs: {0} "{{1}" obsahuje vázané objekty, které kolidují s vázanými objekty následující hlavní položky: {2} "{3}"

# FirmAssociatedPositionMustHavePrincipalWithDifferentBindingObject_Order
source: {0} "{1}" contains reference objects in conflict with reference objects of the following main item: {2} "{3}" in the order {4}
cs: {0} "{1}" obsahuje vázané objekty, které kolidují s vázanými objekty následující hlavní položky: {2} "{3}" v objednávce {4}

# OrderPositionCostPerClickMustBeSpecified
source: No CPC for item {0} in category {1}
cs: Pro pozici {0} do rubriky {1} nebyla uvedena Cena za kliknutí

# OrderPositionCostPerClickMustNotBeLessMinimum
source: CPC for item {0} in category {1} is lower than the minimum
cs: Pro pozici {0} do rubriky {1} byla uvedena Cena za kliknutí méně minimalní hodnoty

# ProjectMustContainCostPerClickMinimumRestriction
source: No minimum CPC specified for item {0} in category {1}
cs: Pro rubriku {0} do prijektu {1} nebyla uvedena minimalní Cena za kliknutí

source: Currency
cs: Měna

# OrderMustHaveActualPrice
source: Items do not correspond to the actual price-list. Please specify items from a currently valid price-list.
cs: Položky neodpovídají aktuálnímu ceníku. Je třeba uvést položky z aktuálně platného ceníku.

# DefaultThemeMustHaveOnlySelfAds
source: The set default topic {0} should contain only self-advertisement
cs: Nastavené výchozí téma {0} musí obsahovat pouze sebepropagaci

# DefaultThemeMustBeExactlyOne_None
source: For the subdivision {0}, default topic is not specified
cs: U pododdílu {0} není uvedeno výchozí téma

# LinkedFirmShouldBeValid_Deleted
source: Company {0} is deleted.
cs: Firma {0} byla smazána.

# LinkedFirmShouldBeValid_ClosedForever
source: The company {0} is hidden forever
cs: Firma {0} je skryta navždy

# AssociatedPositionsGroupCount
source: The price-list item {0} contains more than one group of accompanying items, which is not supported by the system.
cs: Ceníková položka {0} obsahuje více než jednu skupinu průvodních položek - nepodporováno systémem.

# LegalPerson
source: Legal entity of the Customer
cs: Pr. osoba objednatele

# LegalPersonProfile
source: Profile of client's legal entity
cs: Profil pr. osoby klienta

# FirmAssociatedPositionMustHavePrincipalWithMatchedBindingObject
source: {0} "{1}" contains reference objects not available in main items.
cs: {0} "{1}" obsahuje vázané objekty, které chybí v hlavních položkách.

# DefaultThemeMustBeExactlyOne_Many
source: For the subdivision {0}, more than one default topic is specified
cs: U pododdílu {0} je nastaveno více než jedno výchozí téma

# LegalPersonShouldHaveAtLeastOneProfile
source: No profile for client's legal entity
cs: U pr. osoby klienta chybí profil.

# BillsSumShouldMatchOrder
source: The total amount of payments does not equal the planned amount of the order
cs: Součet na fakturách neodpovídá plánované hodnotě objednávky

# OrderPositionAdvertisementMustHaveAdvertisement
source: Advertising materials should be specified in the item {1} for subitem "{1}"
cs: V položce {0} je třeba uvést reklamní materiály pro podpoložku „{1}“

# OrderPositionAdvertisementMustBeCreated
source: At least one reference object should be specified in item {0} for subitem '{1}'
cs: V položce {0} je třeba uvést alespoň jeden vázaný objekt pro podpoložku '{1}'

# OrderMustNotIncludeReleasedPeriod
source: The order is prepared for the period for which a build is already made. Please specify different dates for order placement.
cs: Objednávka je zpracována na období, pro které je již utvořena tvorba sestavy. Je třeba uvést jiný termín zveřejnění objednávky.

# OrderBeginDistrubutionShouldBeFirstDayOfMonth
source: Incorrect start date of placement is specified.
cs: Chybně uvedené datum začátku zveřejnění.

# OrderEndDistrubutionShouldBeLastSecondOfMonth
source: Incorrect end data of placement is specified.
cs: Chybně uvedené datum ukončení zveřejnění.

# BargainScanShouldPresent
source: No scanned copy of the contract
cs: Chybí scan kopie smlouvy

# OrderShouldHaveAtLeastOnePosition
source: The order does not contain any items
cs: Objednávka neobsahuje žádnou položku

# OrderScanShouldPresent
source: No scanned copy of the Invoice
cs: Chybí scan kopie objednávky

# OrderRequiredFieldsShouldBeSpecified
source: It is necessary to fill in all required fields: {0}
cs: Je třeba vyplnit všechna povinná pole: {0}

# OrderPositionCorrespontToInactivePosition
source: Item {0} corresponds to a hidden price-list item. Please specify an active item from a currently valid price-list.
cs: Položka {0} odpovídá skryté položce ceníku. Je třeba uvést aktivní položku z aktuálně platného ceníku.

# OrderPositionMustCorrespontToActualPrice
source: Item {0} does not correspond to the actual price-list. Please specify an item from a currently valid price-list.
cs: Položka {0} neodpovídá aktuálnímu ceníku. Je třeba uvést položku z aktuálně platného ceníku.

# OrderCheckPositionMustHaveAdvertisements
source: Please specify advertising materials in the item {0}
cs: V položce {0} je třeba uvést reklamní materiály

# OrderMustHaveActiveDeal_Inactive
source: Inactive work is specified for an order
cs: Pro objednávku je zadána neaktivní práce/úloha

# LinkedFirmShouldBeValid_ClosedForAscertainment
source: The company {0} is hidden till clarification
cs: Firma {0} je skrytá do vyjasnění.

# LinkedFirmAddressShouldBeValid_Deleted
source: In item {0}, address of the company {1} is hidden forever
cs: V položce {0} je adresa firmy {1} skrytá navždy

# LinkedFirmAddressShouldBeValid_ClosedForAscertainment
source: In item {0}, the address of the company {1} is hidden till clarification
cs: V položce {0} je adresa firmy {1} skrytá do vyjasnění

# LinkedFirmAddressShouldBeValid_NotActive
source: Inactive address {1} is found in item {0}
cs: V položce {0} byla nalezena neaktivní adresa {1}

# LinkedFirmAddressShouldBeValid_NotBelongToFirm
source: Address {1} is found in item {0}, and it does not belong to the company specified in the order
cs: V položce {0} byla nalezena adresa firmy {1}, která nenáleží firmě na objednávce

# LinkedCategoryShouldBeActive
source: Inactive category {1} is found in item {0}
cs: V položce {0} byla nalezena neaktivní rubrika {1}

# LinkedCategoryFirmAddressShouldBeValid
source: The item {0} contains the {1} category that does not belong to the address {2}
cs: V položce {0} byla nalezena rubrika {1}, která nenáleží adrese {2}

# LinkedCategoryShouldBelongToFirm
source: Item {0} has category {1} that does not belong to the company specified in the order
cs: V položce {0} byla nalezena rubrika {1}, která nenáleží firmě na objednávce

# OrderMustHaveActiveLegalEntities
source: The order refers to inactive objects: {0}
cs: Objednávka se odkazuje na neaktivní objekty: {0}

# FirmAndOrderShouldBelongTheSameOrganizationUnit
source: The company division of the order assignment does not correspond to the company division of the selected company
cs: Oddělení organizace účelu objednávky nesouhlasí s oddělením organizace vybrané firmy

# BillsShouldBeCreated
source: It is necessary to create payments for the order
cs: K objednávce je třeba vystavit faktury

# AccountShouldExist
source: The order is not linked to a personal account.
cs: Objednávka nemá vazbu na osobní účet.

# AccountBalanceShouldBePositive
source: There is not enough money to create order. You need: {0}. There are: {1}.
cs: Nemáte dost prostředků k vytvoření objednávky. Je potřeba: {0}. Máte: {1}.

# OrderMustUseCategoriesOnlyAvailableInProject
source: In the item {0}, there are categories that are not referenced to the company division in the city of order destination:
cs: V položce {0} jsou rubriky, které nejsou vázány na oddělení organizace cílového města objednávky:

# MinimalAdvertisementRestrictionShouldBeSpecified
source: In the price-list item {0}, it is necessary to specify minimum quantity of advertisements per issue.
cs: V ceníkové položce {0} je třeba uvést minimální počet reklam k vydání.

# LegalPersonProfileBargainShouldNotBeExpired
source: A contract with expiry date earlier than the date of order signature is specified in the profile {0} of the client's legal entity.
cs: V profilu {0} pr. osoby klienta je uvedena smlouva, jejíž platnost končí před datem podepsání objednávky.

# LegalPersonProfileWarrantyShouldNotBeExpired
source: Power of Attorney of the client's legal entity in the profile {0} has expiry date that is earlier than the signing date of the Invoice
cs: V profilu {0} pr. osoby klienta je uvedena plná moc, jejíž platnost končí před datem podepsání objednávky

# RichChildPositionTypeTemplate
source: Subitem "{0}" of the item
cs: Podpoložka „{0}“ položky

# RichDefaultPositionTypeTemplate
source: Item
cs: Položka

# ThemePeriodMustContainOrderPeriod
source: The order {0} cannot have sales in the topic {1}, since the topic is not valid for the whole period of placement
cs: Objednávka {0} nemůže obsahovat prodej k tématu {1}, protože téma neplatí po celou dobu zveřejnění objednávky

# AdvertisementCountPerThemeShouldBeLimited
source: Too many sales for the topic {0}. {1} items are sold instead of {2} possible.
cs: Příliš mnoho prodejů k tématu {0}. Bylo prodáno {1} položek, je možné prodat {2}.

# ThemeCategoryMustBeActiveAndNotDeleted
source: The topic {0} uses the deleted category {1}.
cs: Téma {0} využívá odstraněnou rubriku {1}.

# OrderMustHaveActiveDeal_Missing
source: No work is specified for the order
cs: Pro objednávku nebyla zadána práce/úloha

# AdvertisementCountPerCategoryShouldBeLimited
source: Too many advertisements ordered in the category {0}: Ordered {1}, permitted not more than {2}.
cs: Do rubriky {0} je objednáno příliš mnoho inzerátů: Objednáno {1}, maximální počet {2}.

# FirmShouldHaveLimitedCategoryCount
source: For the company {0}, too big number of categories is set - {1}. Maximum permitted number - {2}.
cs: U firmy {0} bylo zadáno příliš mnoho rubrik - {1}. Maximální počet - {2}.

# AdvertisementMustBelongToFirm
source: Advertising material {1} that does not belong to the company {2} is selected in the item {0}
cs: V položce {0} byl vybrán reklamní materiál {1}, který nenáleží firmě {2}

# AdvertisementMustPassReview_Draft
source: Advertising material {0} is waiting for moderation
cs: Рекламный материал {0} ожидает модерацию

# AdvertisementMustPassReview_Invalid
source: Advertising material {0} has not passed moderation
cs: Рекламный материал {0} не прошёл модерацию

# AdvertisementShouldNotHaveComments_OkWithComment
source: Advertising material {0} has been approved with comments
cs: Рекламный материал {0} одобрен с замечаниями
